---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsWinderGenLayoutFailure
source: html/5e1bbe31-7152-caea-2b0b-db7c33512ce6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsWinderGenLayoutFailure Property

Fail to generate run layout and then cannot make winder run

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsWinderGenLayoutFailure { get; }
```